# **Module 4 Project Part 2*
#### Author: **Wade Bryson**
#### GitHub Link: https://github.com/WadeBryson
***

## <span style = 'color:Blue'> *Task 1 - Create DataFrame* </span>

In [142]:
# Importing pandas
import pandas as pd
# Creating the dictionary
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}
# Creating the DataFrame from the dictionary
grades = pd.DataFrame(grades_dict)
# Printing the DataFrame to make sure it worked
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## <span style = 'color:Red'> *Task 2 - Custom Index* </span>

#### <span style = 'color:Red'> Updating Index </span>

In [143]:
# Updating Index to Test 1, Test 2, Test 3
grades.index = ['Test 1', 'Test 2', 'Test 3']
# Printing the updated DataFrame to make sure the changes applied
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

#### <span style = 'color:Red'> Accessing Specific Entries </span>

In [144]:
# Finding Eva's grades using ['Eva']
grades['Eva']

Test 1    100
Test 2     87
Test 3     90
Name: Eva, dtype: int64

In [145]:

# Finding Sam's grades using .Sam
grades.Sam

Test 1    94
Test 2    77
Test 3    90
Name: Sam, dtype: int64

## <span style = 'color:Yellow'> *Task 3 Part 1 - Accessing Rows* </span>

In [146]:
# Finding the first Test scores searching by 'Test 1'
grades.loc['Test 1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test 1, dtype: int64

In [147]:
# Find the second Test scores searching by index position
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test 2, dtype: int64

## <span style = 'color:Yellow'> *Task 3 Part 2 - Accessing Subsets* </span>

In [148]:
# Finding Eva's second test score
grades.at['Test 2', 'Eva']

87

In [149]:
# Finding Wally's third test score
grades.iat[2,0]

70

## <span style = 'color:Purple'> *Task 4 - Describe (By Column)* </span>

#### <span style = 'color:Purple'> Finding Descriptive Statistics </span>

In [150]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

#### <span style = 'color:Purple'> Rounding the Descriptive Statistics </span>

In [151]:
# Rounding the describe statistics to two decimal spots
pd.set_option("display.precision", 2)
# Printing to make sure it worked
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

## <span style = 'color:Green'> *Task 5 - Transpose* </span>

#### <span style = 'color:Green'> Finding the average for each column </span>

In [152]:
# Finding the average exam score for each student
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

#### <span style = 'color:Green'> Transposing the Data </span>

In [153]:
# Transpoing the Data (Columns <--> Rows)
grades.T

       Test 1  Test 2  Test 3
Wally      87      96      70
Eva       100      87      90
Sam        94      77      90
Katie     100      81      82
Bob        83      65      85

#### <span style = 'color:Green'> Finding the Transposed Descriptive Statistics </span>

In [154]:
# Finding the transposed descriptive statistics
grades.T.describe()

       Test 1  Test 2  Test 3
count    5.00    5.00    5.00
mean    92.80   81.20   83.40
std      7.66   11.54    8.23
min     83.00   65.00   70.00
25%     87.00   77.00   82.00
50%     94.00   81.00   85.00
75%    100.00   87.00   90.00
max    100.00   96.00   90.00

## <span style = 'color:Orange'> *Task 6 - Sort* </span>

#### <span style = 'color:Orange'> Sorting in Reverse Order </span>

In [155]:
grades.sort_index(ascending=False)

        Wally  Eva  Sam  Katie  Bob
Test 3     70   90   90     82   85
Test 2     96   87   77     81   65
Test 1     87  100   94    100   83

#### <span style = 'color:Orange'> Sorting by Column Names</span>

In [156]:
grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test 1   83  100    100   94     87
Test 2   65   87     81   77     96
Test 3   85   90     82   90     70